{"wrapper":"div.shopify-section","sections":{"intro":{"type":"intro","settings":{"image":"shopify:\/\/shop_images\/Cubs_ClarkStreetImages_2600_2000x809_3fa3954a-f4d9-4004-bcdd-d029f3bf880d.jpg"}},"twoColumns":{"type":"two-columns","settings":{"section_title":"About Clark Street Sports","column_1_text":"Operating out of the city of Chicago, Clark Street Sports can be found in a number of malls, near renowned sports stadiums and nationwide through their online store. Offering officially licensed (and only the best) merchandise to its customer base, Clark Street Sports strives to be your one stop shop for all your Chicago sports team needs. Located in a city with the famed Crosstown Rivals, the Monsters of the Midway, the Blackhawks and the Bulls, Clark Street Sports is no stranger to a winning city and prides itself on being in a city of champions.","column_2_text":"Starting with only six employees in 2004 and growing to over 20 brick and mortar locations as well as establishing a nationwide customer base, Clark Street Sports is constantly pushing itself to become the premier source for the most exciting and quality selection of apparel that represents the passion that sports fans have for their Chicago teams. With its start in the heart of Wrigleyville, Clark Street Sports can now be found across the state of Illinois and Indiana. For those Chicago fans located far away from their favorite teams, nationwide shipping is available."}},"imageWithText":{"type":"image-with-text","blocks":{"8823e2d6-45d6-485e-9ff1-30ed6d7f0ae6":{"type":"Item","settings":{"background_color":"#fbfbfb","image":"shopify:\/\/shop_images\/how-to-reach-us.jpg","title":"Advertising","content":"Talk about Clark Street Sports can frequently be heard on some of Chicagoland’s best radio stations such as ESPN, 1000-AM, The Score, 780-AM, WGN Radio and The Loop. \n\nClark Street Sports also advertises on social media. Follow them on Facebook, Instagram (@ClarkStreetSports) and Twitter (@ClarkStSports).","image_position":"left"}},"1a6d8256-a150-4fc7-9ccf-730a9c465137":{"type":"Item","settings":{"background_color":"#fff","image":"shopify:\/\/shop_images\/donate-written-in-cursive-next-to-a-piggy-bank.jpg","title":"Charities & Donations","content":"Clark Street Sports is honored that they are able to contribute to charities such as Make-A-Wish, the Chicago Fraternal Order of Police, the Salvation Army and a number of local charitable events.","image_position":"right"}}},"block_order":["8823e2d6-45d6-485e-9ff1-30ed6d7f0ae6","1a6d8256-a150-4fc7-9ccf-730a9c465137"],"settings":{}},"instaFeed":{"type":"instagram-feed","settings":{"section_title":""}}},"order":["intro","twoColumns","imageWithText","instaFeed"]}